{
  "footerFootnote": "Seit 2000 bauen wir massgeschneiderte, digitale Lösungen für unsere Kunden — und wir lieben es! Wir setzen Individuallösungen im Digital Banking mit modernsten Web-Technologien und Open-Source-Komponenten um.",
  "socialLinks": [
    {
      "href": "https://www.linkedin.com/company/inventageag",
      "iconName": "linkedIn"
    },
    {
      "href": "https://github.com/inventage",
      "iconName": "github"
    }
  ],
  "pageHelp": {
    "paragraphs": [
      {
        "headline": "Einleitung",
        "values": [
          "Welche neuen Trends gibt es in der Software Entwicklung? Welche Innovationen sind vielversprechend und welche werden bald wieder vergessen sein? Wie wollen wir uns als Inventage weiterentwickeln? Mit diesen und ähnlichen Fragen sehen wir uns als Technologie-Unternehmen täglich konfrontiert. Die technologische Entwicklung schreitet mit grosser Geschwindigkeit fort. Als Inventage müssen wir uns in diesem sich ständig verändernden Umfeld orientieren und fundiert über Technologien und deren Einsatz in unseren Projekten entscheiden."
        ]
      },
      {
        "headline": "Inventage Tech-Radar",
        "values": [
          "Der Inventage Tech-Radar bietet uns ein Gefäss, um Innovationen und Trends strukturiert zu beobachten und dadurch Leitplanken für unsere eigene Weiterentwicklung zu schaffen. Der Tech-Radar ist eine Übersicht von Technologien, Tools, Methoden, Programmiersprachen, welche wir als Inventage für \"neu oder erwähnenswert\" halten. Wir beschränken uns dabei auf diejenigen Technologien, welche in letzter Zeit an Bedeutung gewonnen oder verloren haben.",
          "Bei unserer Arbeit setzen wir uns täglich mit den Digitalisierungswünschen unserer Kunden auseinander. Bei der Umsetzung dieser Wünsche sammeln wir wertvolle Erkenntnisse darüber, ob eine Technologie für uns funktioniert oder nicht. Unsere Einschätzungen über die eingesetzten Technologien und die Erfahrungen aus den Projekten wollen wir in diesem Tech-Radar dokumentieren und teilen."
        ]
      },
      {
        "headline": "Quadranten und Ringe",
        "values": [
          "Mit dem Tech-Radar bilden die Technologie-Landschaft aus der Sicht von Inventage ab. Alle, aus unserer Sicht, erwähnenswerten Technologien werden anhand von zwei Dimensionen im Tech-Radar klassifiziert - in Quadranten und in Ringe.",
          "Die Quadranten stehen für die verschiedenen Arten von Technologien. Die Zuweisung einer Technologie in einen Quadranten ist nicht immer eindeutig. Falls mehrere Quadranten in Frage kommen, entscheiden wir uns dem Bauch heraus.",
          "Während die Einteilung in die Quadranten nur selten zu Diskussionen führt, ist die Wahl des Rings viel umstrittener. Der Ring zeigt an, wie viel Erfahrung wir mit einer Technologie bereits haben und vor allem wie vielversprechend uns die Technologie erscheint."
        ]
      }
    ],
    "quadrants": [
      {
        "name": "Konzepte und Methoden",
        "description": "Elemente des Softwareentwicklungsprozesses und Methoden bzw. Muster zur Strukturierung von Software."
      },
      {
        "name": "Plattformen",
        "description": "Alles, worauf wir Software aufbauen. Infrastrukturplattformen und -dienste, sowohl externe als auch interne."
      },
      {
        "name": "Tools",
        "description": "Tools unterstützen uns bei der Arbeit. Sei das bei der Entwicklung der Software, bei der Installation von Software oder auch bei der Dokumentation von Software. Es können einfache Terminal basierte Tools sein oder aber native Applikationen oder Web-Applikationen mit GUI."
      },
      {
        "name": "Libraries, Frameworks und Programmiersprachen",
        "description": "Im Unterschied zu den Tools sind Libraries, Frameworks und Programmiersprachen Teil des Produkts und werden mit der Software selbst ausgeliefert. Es handelt sich um eine Art \"Runtime Artefakte\"."
      }
    ],
    "rings": [
      {
        "name": "Adopt (Verbreiten)",
        "description": "Wir haben sehr gute Erfahrung gemacht und das Vertrauen in diese Technologie ist gross. Es besteht kein Zweifel, dass die Technologien sich bewährt hat und genügend ausgereift ist, um in unseren Projekten eingesetzt zu werden. Für einen bestimmten Anwendungsfall sehen wir sie als die beste Wahl an.<br/>Wir sind der festen Überzeugung, dass wir als Inventage diese Technologie in unseren Projekten einsetzen wollen."
      },
      {
        "name": "Trial (Testen)",
        "description": "Nach einer ersten Analyse hat sich gezeigt, dass die Technologie vielversprechend ist und es sich lohnt, sie weiter zu verfolgen und auf Probe in einem Projekt einzusetzen. Die Technologie ist aber noch nicht vollständig erprobt. Wir brauchen noch mehr Erfahrung, um uns eine klare Meinung zu bilden.<br/>Inventage sollte diese Technologie in einem Projekt ausprobieren, welches das Risiko tragen kann."
      },
      {
        "name": "Assess (Abschätzen)",
        "description": "Wir haben von dieser Technologie gehört und wollen ihr Potenzial erforschen. Wirkliche Erfahrung haben wir mit der Technologie aber noch keine gesammelt.<br/>Als Inventage wollen wir verstehen, wie wir die Technologien in unseren Projekten einsetzten können. Dazu wollen wir uns genauer informieren. Erfahrungsberichte / Blogs lesen, Dokumentation studieren, ein Buch lesen, die Technologie in einem Pet-Projekt oder im Code-Camp ausprobieren."
      },
      {
        "name": "Hold (Halten)",
        "description": "Bei diesen Technologien ist Vorsicht geboten, wenn möglich in Zukunft vermeiden. Die Technologie ist fehlerhaft oder noch nicht ausgereift genug. Veraltete Technologien gehören auch in diesen Ring, es gibt inzwischen bessere Alternativen.<br/>Inventage verwendet diese Technologien noch in einigen Projekten, möchte sie aber in neuen Projekten nicht mehr einsetzen und längerfristig auch in älteren Projekten ersetzen."
      }
    ],
    "sourcecodeLink": {
      "href": "https://github.com/AOEpeople/aoe_technology_radar",
      "name": "AOE Tech Radar on GitHub",
      "description": "Die Visualisierung dieses Tech-Radars basiert auf dem OpenSource Projekt von AOE:"
    }
  }
}
